# draw_ui funtion
gen = 'Поколение: {}'
speed = 'Скорость: {} ms'
status = 'Состояние игры: {}'

# handle_color_scheme funtion
control_keys = ['Space: запуск/пауза',
                'S: шаг на одно поколение',
                'R: сброс конфигурации к начальной',
                'C: очистить все',
                'L: загрузить конфигурацию из файла',
                'F: сохранить текущую конфигурацию в файл',
                '+/-:  увеличить/уменьшить скорость симуляции',
                'Q: выход',
                'N: следующая цветовая схема',
                'LMB: сделать клетку живой',
                'RMB: сделать клетку мертвой']
